---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitOverload
source: html/289e61f4-9ac7-f454-7544-f5bd100dec76.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitOverload Property

Total connected load for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).

## Syntax (C#)
```csharp
public static FailureDefinitionId CircuitOverload { get; }
```